lelebrr/Willy_ESP32_S3/src/modules/bjs_interpreter/mqjs_bindings.cpp
/**
 * @file mqjs_bindings.cpp
 * @brief Micro QuickJS bindings for Willy
 * @version 1.0
 *
 * Implementation for mquickjs API compatibility.
 */

#include "core/display.h"
#include "globals.h"
#include "interpreter.h"

extern "C" {
#include "mquickjs.h"
}
#include "core/mykeyboard.h"
#include "helpers_js.h"
#include "modules/badusb_ble/ducky_typer.h"
#include "modules/ir/ys_irtm.h"
#include "modules/rf/rf_send.h"
#include "modules/rf/rf_utils.h"
#include "mqjs_stdlib.h"
#include <HTTPClient.h>
#include <LittleFS.h>
#include <SD.h>
#include <WiFi.h>
#include <driver/ledc.h>
#include <esp32-hal-ledc.h>

// Forward declarations
extern int getBattery();

// Helper to convert JSValue to C string (now uses local buffer passed by
// caller)
#define JS_TO_CSTRING(ctx, val, buf) JS_ToCString(ctx, val, buf)

// Forward declaration for the dispatch function
static JSValue js_willy_dispatch(JSContext *ctx, JSValue *this_val, int argc,
                                 JSValue *argv, int magic);

// Macro for easier function definition in the table
#define WILLY_CFUNC_DEF(magic, args)                                           \
  {{.generic_magic = js_willy_dispatch},                                       \
   JS_UNDEFINED,                                                               \
   JS_CFUNC_generic_magic,                                                     \
   args,                                                                       \
   magic}

// Enum for function indices
enum {
  FUNC_DELAY = 0,
  FUNC_MILLIS,
  FUNC_PRINT,
  PRINTLN,
  FUNC_DISPLAY_FILLSCREEN,
  FUNC_DISPLAY_DRAWSTRING,
  FUNC_DISPLAY_DRAWCENTRE,
  FUNC_DISPLAY_SETTEXTCOLOR,
  FUNC_DISPLAY_SETTEXTSIZE,
  FUNC_DISPLAY_WIDTH,
  FUNC_DISPLAY_HEIGHT,
  FUNC_GPIO_DIGITALWRITE,
  FUNC_GPIO_DIGITALREAD,
  FUNC_GPIO_ANALOGWRITE,
  FUNC_GPIO_ANALOGREAD,
  FUNC_GPIO_PINMODE,
  FUNC_WIFI_SCAN,
  FUNC_WIFI_CONNECT,
  FUNC_WIFI_DISCONNECT,
  FUNC_WIFI_STATUS,
  FUNC_WIFI_IP,
  FUNC_HTTP_GET,
  FUNC_STORAGE_READ,
  FUNC_STORAGE_WRITE,
  FUNC_STORAGE_REMOVE,
  FUNC_STORAGE_EXISTS,
  FUNC_SUBGHZ_TX,
  FUNC_BADUSB_RUN,
  FUNC_DEVICE_BATTERY,
  FUNC_DEVICE_FREEHEAP,
  FUNC_DEVICE_BOARD,
  FUNC_DEVICE_SDK,
  FUNC_IR_TX,
  FUNC_IR_SEND,
  FUNC_KEYBOARD_INPUT,
  FUNC_KEYBOARD_HEX,
  FUNC_KEYBOARD_NUM,
  FUNC_DIALOG_ERROR,
  FUNC_DIALOG_WARNING,
  FUNC_DIALOG_INFO,
  FUNC_DIALOG_SUCCESS,
  FUNC_COMPAT_GETBOARDNAME,
  FUNC_COMPAT_GETCPUFREQ,
  FUNC_COMPAT_GETFREEHEAP,
  FUNC_COMPAT_GETFLASHCHIPSIZE,
  FUNC_COMPAT_GETSDKVERSION,
  FUNC_GPIO_LEDC_ATTACH,
  FUNC_GPIO_LEDC_WRITE,
  FUNC_GPIO_LEDC_DETACH,
  FUNC_COUNT
};

// Function table for mQuickJS
extern "C" const JSCFunctionDef willy_func_table[] = {
    WILLY_CFUNC_DEF(FUNC_DELAY, 1),
    WILLY_CFUNC_DEF(FUNC_MILLIS, 0),
    WILLY_CFUNC_DEF(FUNC_PRINT, 1),
    WILLY_CFUNC_DEF(PRINTLN, 1),
    WILLY_CFUNC_DEF(FUNC_DISPLAY_FILLSCREEN, 1),
    WILLY_CFUNC_DEF(FUNC_DISPLAY_DRAWSTRING, 3),
    WILLY_CFUNC_DEF(FUNC_DISPLAY_DRAWCENTRE, 4),
    WILLY_CFUNC_DEF(FUNC_DISPLAY_SETTEXTCOLOR, 2),
    WILLY_CFUNC_DEF(FUNC_DISPLAY_SETTEXTSIZE, 1),
    WILLY_CFUNC_DEF(FUNC_DISPLAY_WIDTH, 0),
    WILLY_CFUNC_DEF(FUNC_DISPLAY_HEIGHT, 0),
    WILLY_CFUNC_DEF(FUNC_GPIO_DIGITALWRITE, 2),
    WILLY_CFUNC_DEF(FUNC_GPIO_DIGITALREAD, 1),
    WILLY_CFUNC_DEF(FUNC_GPIO_ANALOGWRITE, 2),
    WILLY_CFUNC_DEF(FUNC_GPIO_ANALOGREAD, 1),
    WILLY_CFUNC_DEF(FUNC_GPIO_PINMODE, 2),
    WILLY_CFUNC_DEF(FUNC_WIFI_SCAN, 0),
    WILLY_CFUNC_DEF(FUNC_WIFI_CONNECT, 3),
    WILLY_CFUNC_DEF(FUNC_WIFI_DISCONNECT, 0),
    WILLY_CFUNC_DEF(FUNC_WIFI_STATUS, 0),
    WILLY_CFUNC_DEF(FUNC_WIFI_IP, 0),
    WILLY_CFUNC_DEF(FUNC_HTTP_GET, 1),
    WILLY_CFUNC_DEF(FUNC_STORAGE_READ, 1),
    WILLY_CFUNC_DEF(FUNC_STORAGE_WRITE, 3),
    WILLY_CFUNC_DEF(FUNC_STORAGE_REMOVE, 1),
    WILLY_CFUNC_DEF(FUNC_STORAGE_EXISTS, 1),
    WILLY_CFUNC_DEF(FUNC_SUBGHZ_TX, 4),
    WILLY_CFUNC_DEF(FUNC_BADUSB_RUN, 1),
    WILLY_CFUNC_DEF(FUNC_DEVICE_BATTERY, 0),
    WILLY_CFUNC_DEF(FUNC_DEVICE_FREEHEAP, 0),
    WILLY_CFUNC_DEF(FUNC_DEVICE_BOARD, 0),
    WILLY_CFUNC_DEF(FUNC_DEVICE_SDK, 0),
    WILLY_CFUNC_DEF(FUNC_IR_TX, 3),
    WILLY_CFUNC_DEF(FUNC_IR_SEND, 3),
    WILLY_CFUNC_DEF(FUNC_KEYBOARD_INPUT, 3),
    WILLY_CFUNC_DEF(FUNC_KEYBOARD_HEX, 3),
    WILLY_CFUNC_DEF(FUNC_KEYBOARD_NUM, 3),
    WILLY_CFUNC_DEF(FUNC_DIALOG_ERROR, 1),
    WILLY_CFUNC_DEF(FUNC_DIALOG_WARNING, 1),
    WILLY_CFUNC_DEF(FUNC_DIALOG_INFO, 1),
    WILLY_CFUNC_DEF(FUNC_DIALOG_SUCCESS, 1),
    WILLY_CFUNC_DEF(FUNC_COMPAT_GETBOARDNAME, 0),
    WILLY_CFUNC_DEF(FUNC_COMPAT_GETCPUFREQ, 0),
    WILLY_CFUNC_DEF(FUNC_COMPAT_GETFREEHEAP, 0),
    WILLY_CFUNC_DEF(FUNC_COMPAT_GETFLASHCHIPSIZE, 0),
    WILLY_CFUNC_DEF(FUNC_COMPAT_GETSDKVERSION, 0),
    WILLY_CFUNC_DEF(FUNC_GPIO_LEDC_ATTACH, 3),
    WILLY_CFUNC_DEF(FUNC_GPIO_LEDC_WRITE, 2),
    WILLY_CFUNC_DEF(FUNC_GPIO_LEDC_DETACH, 1)};

extern "C" const JSSTDLibraryDef willy_stdlib_def = {
    NULL, willy_func_table, NULL, 0, 64, 0, 0, JS_CLASS_USER};

// delay(ms)
static JSValue func_delay(JSContext *ctx, JSValue *this_val, int argc,
                          JSValue *argv) {
  int ms = 0;
  if (argc > 0)
    JS_ToInt32(ctx, &ms, argv[0]);
  delay(ms);
  return JS_UNDEFINED;
}

// millis()
static JSValue func_millis(JSContext *ctx, JSValue *this_val, int argc,
                           JSValue *argv) {
  return JS_NewInt32(ctx, millis());
}

// print(...)
static JSValue func_print(JSContext *ctx, JSValue *this_val, int argc,
                          JSValue *argv) {
  for (int i = 0; i < argc; i++) {
    JSCStringBuf buf;
    const char *s = JS_TO_CSTRING(ctx, argv[i], &buf);
    Serial.print(s);
  }
  return JS_UNDEFINED;
}

// println(...)
static JSValue func_println(JSContext *ctx, JSValue *this_val, int argc,
                            JSValue *argv) {
  func_print(ctx, this_val, argc, argv);
  Serial.println();
  return JS_UNDEFINED;
}

// display.fillScreen(color)
static JSValue func_display_fillScreen(JSContext *ctx, JSValue *this_val,
                                       int argc, JSValue *argv) {
  int color = 0;
  if (argc > 0)
    JS_ToInt32(ctx, &color, argv[0]);
  tft.fillScreen(color);
  return JS_UNDEFINED;
}

// display.drawString(str, x, y)
static JSValue func_display_drawString(JSContext *ctx, JSValue *this_val,
                                       int argc, JSValue *argv) {
  JSCStringBuf buf;
  const char *s = JS_TO_CSTRING(ctx, argv[0], &buf);
  int x = 0, y = 0;
  if (argc > 1)
    JS_ToInt32(ctx, &x, argv[1]);
  if (argc > 2)
    JS_ToInt32(ctx, &y, argv[2]);
  tft.drawString(s, x, y);
  return JS_UNDEFINED;
}

// display.drawCentreString(str, x, y, font)
static JSValue func_display_drawCentreString(JSContext *ctx, JSValue *this_val,
                                             int argc, JSValue *argv) {
  JSCStringBuf buf;
  const char *s = JS_TO_CSTRING(ctx, argv[0], &buf);
  int x = 0, y = 0, f = 1;
  if (argc > 1)
    JS_ToInt32(ctx, &x, argv[1]);
  if (argc > 2)
    JS_ToInt32(ctx, &y, argv[2]);
  if (argc > 3)
    JS_ToInt32(ctx, &f, argv[3]);
  tft.drawCentreString(s, x, y, f);
  return JS_UNDEFINED;
}

