lelebrr/Willy_ESP32_S3/src/modules/bjs_interpreter/mqjs_bindings.cpp
// display.setTextColor(fg, bg)
static JSValue func_display_setTextColor(JSContext *ctx, JSValue *this_val,
                                         int argc, JSValue *argv) {
  int fg = 0, bg = -1;
  JS_ToInt32(ctx, &fg, argv[0]);
  if (argc > 1)
    JS_ToInt32(ctx, &bg, argv[1]);
  tft.setTextColor(fg, bg);
  return JS_UNDEFINED;
}

// display.setTextSize(size)
static JSValue func_display_setTextSize(JSContext *ctx, JSValue *this_val,
                                        int argc, JSValue *argv) {
  int s = 1;
  if (argc > 0)
    JS_ToInt32(ctx, &s, argv[0]);
  tft.setTextSize(s);
  return JS_UNDEFINED;
}

// display.width()
static JSValue func_display_width(JSContext *ctx, JSValue *this_val, int argc,
                                  JSValue *argv) {
  return JS_NewInt32(ctx, tftWidth);
}

// display.height()
static JSValue func_display_height(JSContext *ctx, JSValue *this_val, int argc,
                                   JSValue *argv) {
  return JS_NewInt32(ctx, tftHeight);
}

// gpio.digitalWrite(pin, value)
static JSValue func_gpio_digitalWrite(JSContext *ctx, JSValue *this_val,
                                      int argc, JSValue *argv) {
  int pin = 0, val = 0;
  JS_ToInt32(ctx, &pin, argv[0]);
  if (argc > 1)
    JS_ToInt32(ctx, &val, argv[1]);
  digitalWrite(pin, val);
  return JS_UNDEFINED;
}

// gpio.digitalRead(pin)
static JSValue func_gpio_digitalRead(JSContext *ctx, JSValue *this_val,
                                     int argc, JSValue *argv) {
  int pin = 0;
  JS_ToInt32(ctx, &pin, argv[0]);
  return JS_NewInt32(ctx, digitalRead(pin));
}

// gpio.analogWrite(pin, value)
static JSValue func_gpio_analogWrite(JSContext *ctx, JSValue *this_val,
                                     int argc, JSValue *argv) {
  int pin = 0, val = 0;
  JS_ToInt32(ctx, &pin, argv[0]);
  if (argc > 1)
    JS_ToInt32(ctx, &val, argv[1]);
  analogWrite(pin, val);
  return JS_UNDEFINED;
}

// gpio.analogRead(pin)
static JSValue func_gpio_analogRead(JSContext *ctx, JSValue *this_val, int argc,
                                    JSValue *argv) {
  int pin = 0;
  JS_ToInt32(ctx, &pin, argv[0]);
  // return JS_NewInt32(ctx, analogRead(pin)); // Commented out to avoid ADC
  // conflict
  return JS_NewInt32(ctx, 0);
}

// gpio.pinMode(pin, mode)
static JSValue func_gpio_pinMode(JSContext *ctx, JSValue *this_val, int argc,
                                 JSValue *argv) {
  int pin = 0, mode = 0;
  JS_ToInt32(ctx, &pin, argv[0]);
  if (argc > 1)
    JS_ToInt32(ctx, &mode, argv[1]);
  pinMode(pin, mode);
  return JS_UNDEFINED;
}

// WiFi.scan() -> returns array of SSIDs
static JSValue func_wifi_scan(JSContext *ctx, JSValue *this_val, int argc,
                              JSValue *argv) {
  int n = WiFi.scanNetworks();
  JSValue arr = JS_NewArray(ctx, n);
  for (int i = 0; i < n; i++) {
    JS_SetPropertyUint32(ctx, arr, i, JS_NewString(ctx, WiFi.SSID(i).c_str()));
  }
  return arr;
}

// wifi.connect(ssid, password, timeout)
static JSValue func_wifi_connect(JSContext *ctx, JSValue *this_val, int argc,
                                 JSValue *argv) {
  JSCStringBuf buf1, buf2;
  const char *ssid = JS_TO_CSTRING(ctx, argv[0], &buf1);
  const char *pwd = (argc > 1) ? JS_TO_CSTRING(ctx, argv[1], &buf2) : "";
  int timeout = 30;
  if (argc > 2)
    JS_ToInt32(ctx, &timeout, argv[2]);

  WiFi.begin(ssid, pwd);
  int waited = 0;
  while (WiFi.status() != WL_CONNECTED && waited < timeout) {
    delay(1000);
    waited++;
  }
  return JS_NewBool(WiFi.status() == WL_CONNECTED);
}

// wifi.disconnect()
static JSValue func_wifi_disconnect(JSContext *ctx, JSValue *this_val, int argc,
                                    JSValue *argv) {
  WiFi.disconnect();
  return JS_UNDEFINED;
}

// wifi.status()
static JSValue func_wifi_status(JSContext *ctx, JSValue *this_val, int argc,
                                JSValue *argv) {
  return JS_NewBool(WiFi.status() == WL_CONNECTED);
}

// wifi.ip()
static JSValue func_wifi_ip(JSContext *ctx, JSValue *this_val, int argc,
                            JSValue *argv) {
  String ip = WiFi.localIP().toString();
  return JS_NewStringLen(ctx, ip.c_str(), ip.length());
}

// http.get(url) -> returns string
static JSValue func_http_get(JSContext *ctx, JSValue *this_val, int argc,
                             JSValue *argv) {
  JSCStringBuf buf;
  const char *url = JS_TO_CSTRING(ctx, argv[0], &buf);
  if (!url)
    return JS_EXCEPTION;

  HTTPClient http;
  http.begin(url);
  int httpCode = http.GET();
  String payload = "";
  if (httpCode > 0) {
    payload = http.getString();
  }
  http.end();
  return JS_NewString(ctx, payload.c_str());
}

// storage.read(path)
static JSValue func_storage_read(JSContext *ctx, JSValue *this_val, int argc,
                                 JSValue *argv) {
  JSCStringBuf buf;
  const char *path = JS_TO_CSTRING(ctx, argv[0], &buf);
  if (!path)
    return JS_EXCEPTION;

  FS *fs = &LittleFS;
  if (String(path).startsWith("/sd"))
    fs = &SD;

  if (!fs->exists(path))
    return JS_UNDEFINED;
  File f = fs->open(path, "r");
  if (!f)
    return JS_UNDEFINED;
  String content = f.readString();
  f.close();
  return JS_NewString(ctx, content.c_str());
}

// storage.write(path, content, append)
static JSValue func_storage_write(JSContext *ctx, JSValue *this_val, int argc,
                                  JSValue *argv) {
  JSCStringBuf buf1, buf2;
  const char *path = JS_TO_CSTRING(ctx, argv[0], &buf1);
  const char *content = JS_TO_CSTRING(ctx, argv[1], &buf2);
  bool append = JS_ToBool(ctx, argv[2]);
  if (!path || !content)
    return JS_EXCEPTION;

  FS *fs = &LittleFS;
  if (String(path).startsWith("/sd"))
    fs = &SD;

  File f = fs->open(path, append ? "a" : "w");
  if (!f)
    return JS_FALSE;
  f.print(content);
  f.close();
  return JS_TRUE;
}

// storage.remove(path)
static JSValue func_storage_remove(JSContext *ctx, JSValue *this_val, int argc,
                                   JSValue *argv) {
  JSCStringBuf buf;
  const char *path = JS_TO_CSTRING(ctx, argv[0], &buf);
  if (!path)
    return JS_EXCEPTION;

  FS *fs = &LittleFS;
  if (String(path).startsWith("/sd"))
    fs = &SD;

  return fs->remove(path) ? JS_TRUE : JS_FALSE;
}

// storage.exists(path)
static JSValue func_storage_exists(JSContext *ctx, JSValue *this_val, int argc,
                                   JSValue *argv) {
  JSCStringBuf buf;
  const char *path = JS_TO_CSTRING(ctx, argv[0], &buf);
  if (!path)
    return JS_EXCEPTION;

  FS *fs = &LittleFS;
  if (String(path).startsWith("/sd"))
    fs = &SD;

  return fs->exists(path) ? JS_TRUE : JS_FALSE;
}

