lelebrr/Willy_ESP32_S3/src/modules/bjs_interpreter/mqjs_bindings.cpp
// subghz.tx(data, freq, te, count)
static JSValue func_subghz_tx(JSContext *ctx, JSValue *this_val, int argc,
                              JSValue *argv) {
  JSCStringBuf buf;
  const char *data = JS_TO_CSTRING(ctx, argv[0], &buf);
  int te = 300, count = 10;
  if (argc > 1) {
    int freqInt;
    JS_ToInt32(ctx, &freqInt, argv[1]);
  }
  if (argc > 2)
    JS_ToInt32(ctx, &te, argv[2]);
  if (argc > 3)
    JS_ToInt32(ctx, &count, argv[3]);

  if (String(data).endsWith(".sub")) {
    FS *fs = &LittleFS;
    if (String(data).startsWith("/sd"))
      fs = &SD;
    return JS_NewBool(txSubFile(fs, data, true));
  } else {
    // Simple RC Switch send simulation/proxy
    RCSwitch_send(strtoull(data, NULL, 16), 24, te, 1, count);
    return JS_TRUE;
  }
}

// badusb.run(filename)
static JSValue func_badusb_run(JSContext *ctx, JSValue *this_val, int argc,
                               JSValue *argv) {
  JSCStringBuf buf;
  const char *filename = JS_TO_CSTRING(ctx, argv[0], &buf);
  FS *fs = &LittleFS;
  if (String(filename).startsWith("/sd"))
    fs = &SD;

  HIDInterface *hid = nullptr;
  ducky_startKb(hid, false);
  if (hid) {
    key_input(*fs, filename, hid);
    delete hid;
    return JS_TRUE;
  }
  return JS_FALSE;
}

// device.battery()
static JSValue func_device_battery(JSContext *ctx, JSValue *this_val, int argc,
                                   JSValue *argv) {
  return JS_NewInt32(ctx, getBattery());
}

// device.freeHeap()
static JSValue func_device_freeHeap(JSContext *ctx, JSValue *this_val, int argc,
                                    JSValue *argv) {
  return JS_NewInt32(ctx, ESP.getFreeHeap());
}

// device.board()
static JSValue func_device_board(JSContext *ctx, JSValue *this_val, int argc,
                                 JSValue *argv) {
  return JS_NewStringLen(ctx, "ESP32", 5);
}

// device.sdk()
static JSValue func_device_sdk(JSContext *ctx, JSValue *this_val, int argc,
                               JSValue *argv) {
  return JS_NewStringLen(ctx, ESP.getSdkVersion(), strlen(ESP.getSdkVersion()));
}

// ir.tx(protocol, address, command)
static JSValue func_ir_tx(JSContext *ctx, JSValue *this_val, int argc,
                          JSValue *argv) {
  int addr = 0, cmd = 0;
  if (argc > 1)
    JS_ToInt32(ctx, &addr, argv[1]);
  if (argc > 2)
    JS_ToInt32(ctx, &cmd, argv[2]);
  ysIrtm.sendNEC(addr, cmd);
  return JS_TRUE;
}

// ir.send(protocol, data, bits)
static JSValue func_ir_send(JSContext *ctx, JSValue *this_val, int argc,
                            JSValue *argv) {
  int addr = 0, cmd = 0;
  if (argc > 1)
    JS_ToInt32(ctx, &addr, argv[1]);
  if (argc > 2)
    JS_ToInt32(ctx, &cmd, argv[2]);
  ysIrtm.sendNEC(addr, cmd);
  return JS_TRUE;
}

// keyboard.input(msg, def, maxLen)
static JSValue func_keyboard_input(JSContext *ctx, JSValue *this_val, int argc,
                                   JSValue *argv) {
  JSCStringBuf buf1, buf2;
  const char *msg = JS_TO_CSTRING(ctx, argv[0], &buf1);
  const char *def = (argc > 1) ? JS_TO_CSTRING(ctx, argv[1], &buf2) : "";
  int maxLen = 76;
  if (argc > 2)
    JS_ToInt32(ctx, &maxLen, argv[2]);

  String res = keyboard(def, maxLen, msg);
  return JS_NewString(ctx, res.c_str());
}

// keyboard.hex(msg, def, maxLen)
static JSValue func_keyboard_hex(JSContext *ctx, JSValue *this_val, int argc,
                                 JSValue *argv) {
  JSCStringBuf buf1, buf2;
  const char *msg = JS_TO_CSTRING(ctx, argv[0], &buf1);
  const char *def = (argc > 1) ? JS_TO_CSTRING(ctx, argv[1], &buf2) : "";
  int maxLen = 76;
  if (argc > 2)
    JS_ToInt32(ctx, &maxLen, argv[2]);

  String res = hex_keyboard(def, maxLen, msg);
  return JS_NewString(ctx, res.c_str());
}

// keyboard.num(msg, def, maxLen)
static JSValue func_keyboard_num(JSContext *ctx, JSValue *this_val, int argc,
                                 JSValue *argv) {
  JSCStringBuf buf1, buf2;
  const char *msg = JS_TO_CSTRING(ctx, argv[0], &buf1);
  const char *def = (argc > 1) ? JS_TO_CSTRING(ctx, argv[1], &buf2) : "0";
  int maxLen = 10;
  if (argc > 2)
    JS_ToInt32(ctx, &maxLen, argv[2]);

  String res = num_keyboard(def, maxLen, msg);
  return JS_NewInt32(ctx, res.toInt());
}

// dialog.error(msg)
static JSValue func_dialog_error(JSContext *ctx, JSValue *this_val, int argc,
                                 JSValue *argv) {
  JSCStringBuf buf;
  displayError(JS_TO_CSTRING(ctx, argv[0], &buf), true);
  return JS_UNDEFINED;
}

// dialog.warning(msg)
static JSValue func_dialog_warning(JSContext *ctx, JSValue *this_val, int argc,
                                   JSValue *argv) {
  JSCStringBuf buf;
  displayWarning(JS_TO_CSTRING(ctx, argv[0], &buf), true);
  return JS_UNDEFINED;
}

// dialog.info(msg)
static JSValue func_dialog_info(JSContext *ctx, JSValue *this_val, int argc,
                                JSValue *argv) {
  JSCStringBuf buf;
  displayInfo(JS_TO_CSTRING(ctx, argv[0], &buf), true);
  return JS_UNDEFINED;
}

// dialog.success(msg)
static JSValue func_dialog_success(JSContext *ctx, JSValue *this_val, int argc,
                                   JSValue *argv) {
  JSCStringBuf buf;
  displaySuccess(JS_TO_CSTRING(ctx, argv[0], &buf), true);
  return JS_UNDEFINED;
}

// compat.getBoardName()
static JSValue func_compat_getBoardName(JSContext *ctx, JSValue *this_val,
                                        int argc, JSValue *argv) {
  return JS_NewStringLen(ctx, "ESP32", 5);
}

// compat.getCpuFreqMHz()
static JSValue func_compat_getCpuFreqMHz(JSContext *ctx, JSValue *this_val,
                                         int argc, JSValue *argv) {
  return JS_NewInt32(ctx, ESP.getCpuFreqMHz());
}

// compat.getFreeHeap()
static JSValue func_compat_getFreeHeap(JSContext *ctx, JSValue *this_val,
                                       int argc, JSValue *argv) {
  return JS_NewInt32(ctx, ESP.getFreeHeap());
}

// compat.getFlashChipSize()
static JSValue func_compat_getFlashChipSize(JSContext *ctx, JSValue *this_val,
                                            int argc, JSValue *argv) {
  return JS_NewInt32(ctx, ESP.getFlashChipSize());
}

