lelebrr/Willy_ESP32_S3/src/modules/bjs_interpreter/mqjs_bindings.cpp
// compat.getSdkVersion()
static JSValue func_compat_getSdkVersion(JSContext *ctx, JSValue *this_val,
                                         int argc, JSValue *argv) {
  return JS_NewStringLen(ctx, ESP.getSdkVersion(), strlen(ESP.getSdkVersion()));
}

// gpio.ledcAttach(pin, freq, resolution)
static JSValue func_gpio_ledcAttach(JSContext *ctx, JSValue *this_val, int argc,
                                    JSValue *argv) {
  if (argc < 3)
    return JS_UNDEFINED;
  int pin;
  JS_ToInt32(ctx, &pin, argv[0]);
  int freq;
  JS_ToInt32(ctx, &freq, argv[1]);
  int resolution;
  JS_ToInt32(ctx, &resolution, argv[2]);
  int ch = pin % 16; // Simple channel mapping
  ledcAttach(ch, freq, resolution);
  ledcAttach(pin, freq, ch);
  return JS_NewInt32(ctx, ch);
}

// gpio.ledcWrite(pin, value)
static JSValue func_gpio_ledcWrite(JSContext *ctx, JSValue *this_val, int argc,
                                   JSValue *argv) {
  if (argc < 2)
    return JS_UNDEFINED;
  int pin;
  JS_ToInt32(ctx, &pin, argv[0]);
  int value;
  JS_ToInt32(ctx, &value, argv[1]);
  int ch = pin % 16;
  ledcWrite(ch, value);
  return JS_UNDEFINED;
}

// gpio.ledcDetach(pin)
static JSValue func_gpio_ledcDetach(JSContext *ctx, JSValue *this_val, int argc,
                                    JSValue *argv) {
  if (argc < 1)
    return JS_UNDEFINED;
  int pin;
  JS_ToInt32(ctx, &pin, argv[0]);
  int ch = pin % 16;
  ledcDetach(pin);
  return JS_UNDEFINED;
}

// Function dispatch table
static JSValue js_willy_dispatch(JSContext *ctx, JSValue *this_val, int argc,
                                 JSValue *argv, int magic) {
  switch (magic) {
  case FUNC_DELAY:
    return func_delay(ctx, this_val, argc, argv);
  case FUNC_MILLIS:
    return func_millis(ctx, this_val, argc, argv);
  case FUNC_PRINT:
    return func_print(ctx, this_val, argc, argv);
  case PRINTLN:
    return func_println(ctx, this_val, argc, argv);
  case FUNC_DISPLAY_FILLSCREEN:
    return func_display_fillScreen(ctx, this_val, argc, argv);
  case FUNC_DISPLAY_DRAWSTRING:
    return func_display_drawString(ctx, this_val, argc, argv);
  case FUNC_DISPLAY_DRAWCENTRE:
    return func_display_drawCentreString(ctx, this_val, argc, argv);
  case FUNC_DISPLAY_SETTEXTCOLOR:
    return func_display_setTextColor(ctx, this_val, argc, argv);
  case FUNC_DISPLAY_SETTEXTSIZE:
    return func_display_setTextSize(ctx, this_val, argc, argv);
  case FUNC_DISPLAY_WIDTH:
    return func_display_width(ctx, this_val, argc, argv);
  case FUNC_DISPLAY_HEIGHT:
    return func_display_height(ctx, this_val, argc, argv);
  case FUNC_GPIO_DIGITALWRITE:
    return func_gpio_digitalWrite(ctx, this_val, argc, argv);
  case FUNC_GPIO_DIGITALREAD:
    return func_gpio_digitalRead(ctx, this_val, argc, argv);
  case FUNC_GPIO_ANALOGWRITE:
    return func_gpio_analogWrite(ctx, this_val, argc, argv);
  case FUNC_GPIO_ANALOGREAD:
    return func_gpio_analogRead(ctx, this_val, argc, argv);
  case FUNC_GPIO_PINMODE:
    return func_gpio_pinMode(ctx, this_val, argc, argv);
  case FUNC_WIFI_SCAN:
    return func_wifi_scan(ctx, this_val, argc, argv);
  case FUNC_WIFI_CONNECT:
    return func_wifi_connect(ctx, this_val, argc, argv);
  case FUNC_WIFI_DISCONNECT:
    return func_wifi_disconnect(ctx, this_val, argc, argv);
  case FUNC_WIFI_STATUS:
    return func_wifi_status(ctx, this_val, argc, argv);
  case FUNC_WIFI_IP:
    return func_wifi_ip(ctx, this_val, argc, argv);
  case FUNC_HTTP_GET:
    return func_http_get(ctx, this_val, argc, argv);
  case FUNC_STORAGE_READ:
    return func_storage_read(ctx, this_val, argc, argv);
  case FUNC_STORAGE_WRITE:
    return func_storage_write(ctx, this_val, argc, argv);
  case FUNC_STORAGE_REMOVE:
    return func_storage_remove(ctx, this_val, argc, argv);
  case FUNC_STORAGE_EXISTS:
    return func_storage_exists(ctx, this_val, argc, argv);
  case FUNC_SUBGHZ_TX:
    return func_subghz_tx(ctx, this_val, argc, argv);
  case FUNC_BADUSB_RUN:
    return func_badusb_run(ctx, this_val, argc, argv);
  case FUNC_DEVICE_BATTERY:
    return func_device_battery(ctx, this_val, argc, argv);
  case FUNC_DEVICE_FREEHEAP:
    return func_device_freeHeap(ctx, this_val, argc, argv);
  case FUNC_DEVICE_BOARD:
    return func_device_board(ctx, this_val, argc, argv);
  case FUNC_DEVICE_SDK:
    return func_device_sdk(ctx, this_val, argc, argv);
  case FUNC_IR_TX:
    return func_ir_tx(ctx, this_val, argc, argv);
  case FUNC_IR_SEND:
    return func_ir_send(ctx, this_val, argc, argv);
  case FUNC_KEYBOARD_INPUT:
    return func_keyboard_input(ctx, this_val, argc, argv);
  case FUNC_KEYBOARD_HEX:
    return func_keyboard_hex(ctx, this_val, argc, argv);
  case FUNC_KEYBOARD_NUM:
    return func_keyboard_num(ctx, this_val, argc, argv);
  case FUNC_DIALOG_ERROR:
    return func_dialog_error(ctx, this_val, argc, argv);
  case FUNC_DIALOG_WARNING:
    return func_dialog_warning(ctx, this_val, argc, argv);
  case FUNC_DIALOG_INFO:
    return func_dialog_info(ctx, this_val, argc, argv);
  case FUNC_DIALOG_SUCCESS:
    return func_dialog_success(ctx, this_val, argc, argv);
  case FUNC_COMPAT_GETBOARDNAME:
    return func_compat_getBoardName(ctx, this_val, argc, argv);
  case FUNC_COMPAT_GETCPUFREQ:
    return func_compat_getCpuFreqMHz(ctx, this_val, argc, argv);
  case FUNC_COMPAT_GETFREEHEAP:
    return func_compat_getFreeHeap(ctx, this_val, argc, argv);
  case FUNC_COMPAT_GETFLASHCHIPSIZE:
    return func_compat_getFlashChipSize(ctx, this_val, argc, argv);
  case FUNC_COMPAT_GETSDKVERSION:
    return func_compat_getSdkVersion(ctx, this_val, argc, argv);
  case FUNC_GPIO_LEDC_ATTACH:
    return func_gpio_ledcAttach(ctx, this_val, argc, argv);
  case FUNC_GPIO_LEDC_WRITE:
    return func_gpio_ledcWrite(ctx, this_val, argc, argv);
  case FUNC_GPIO_LEDC_DETACH:
    return func_gpio_ledcDetach(ctx, this_val, argc, argv);
  default:
    return JS_UNDEFINED;
  }
}

// Main init function - registers all Willy API functions
void js_willy_init(JSContext *ctx) {
  JSValue global_obj = JS_GetGlobalObject(ctx);

  // willy namespace
  JSValue willy = JS_NewObject(ctx);
  JS_SetPropertyStr(ctx, willy, "delay",
                    JS_NewCFunctionParams(ctx, FUNC_DELAY, JS_UNDEFINED));
  JS_SetPropertyStr(ctx, willy, "millis",
                    JS_NewCFunctionParams(ctx, FUNC_MILLIS, JS_UNDEFINED));
  JS_SetPropertyStr(ctx, willy, "log",
                    JS_NewCFunctionParams(ctx, PRINTLN, JS_UNDEFINED));
  JS_SetPropertyStr(ctx, global_obj, "willy", willy);

  // Print functions
  JS_SetPropertyStr(ctx, global_obj, "print",
                    JS_NewCFunctionParams(ctx, FUNC_PRINT, JS_UNDEFINED));
  JS_SetPropertyStr(ctx, global_obj, "println",
                    JS_NewCFunctionParams(ctx, PRINTLN, JS_UNDEFINED));

  // tft (display) namespace
  JSValue display = JS_NewObject(ctx);
  JS_SetPropertyStr(
      ctx, display, "fillScreen",
      JS_NewCFunctionParams(ctx, FUNC_DISPLAY_FILLSCREEN, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, display, "drawString",
      JS_NewCFunctionParams(ctx, FUNC_DISPLAY_DRAWSTRING, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, display, "drawCentreString",
      JS_NewCFunctionParams(ctx, FUNC_DISPLAY_DRAWCENTRE, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, display, "setTextColor",
      JS_NewCFunctionParams(ctx, FUNC_DISPLAY_SETTEXTCOLOR, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, display, "setTextSize",
      JS_NewCFunctionParams(ctx, FUNC_DISPLAY_SETTEXTSIZE, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, display, "width",
      JS_NewCFunctionParams(ctx, FUNC_DISPLAY_WIDTH, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, display, "height",
      JS_NewCFunctionParams(ctx, FUNC_DISPLAY_HEIGHT, JS_UNDEFINED));
  JS_SetPropertyStr(ctx, global_obj, "tft", display);

  // gpio namespace
  JSValue gpio = JS_NewObject(ctx);
  JS_SetPropertyStr(
      ctx, gpio, "digitalWrite",
      JS_NewCFunctionParams(ctx, FUNC_GPIO_DIGITALWRITE, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, gpio, "digitalRead",
      JS_NewCFunctionParams(ctx, FUNC_GPIO_DIGITALREAD, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, gpio, "analogWrite",
      JS_NewCFunctionParams(ctx, FUNC_GPIO_ANALOGWRITE, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, gpio, "analogRead",
      JS_NewCFunctionParams(ctx, FUNC_GPIO_ANALOGREAD, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, gpio, "pinMode",
      JS_NewCFunctionParams(ctx, FUNC_GPIO_PINMODE, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, gpio, "ledcAttach",
      JS_NewCFunctionParams(ctx, FUNC_GPIO_LEDC_ATTACH, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, gpio, "ledcWrite",
      JS_NewCFunctionParams(ctx, FUNC_GPIO_LEDC_WRITE, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, gpio, "ledcDetach",
      JS_NewCFunctionParams(ctx, FUNC_GPIO_LEDC_DETACH, JS_UNDEFINED));
  JS_SetPropertyStr(ctx, global_obj, "gpio", gpio);

  // WiFi namespace
  JSValue wifi = JS_NewObject(ctx);
  JS_SetPropertyStr(ctx, wifi, "scan",
                    JS_NewCFunctionParams(ctx, FUNC_WIFI_SCAN, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, wifi, "connect",
      JS_NewCFunctionParams(ctx, FUNC_WIFI_CONNECT, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, wifi, "disconnect",
      JS_NewCFunctionParams(ctx, FUNC_WIFI_DISCONNECT, JS_UNDEFINED));
  JS_SetPropertyStr(ctx, wifi, "status",
                    JS_NewCFunctionParams(ctx, FUNC_WIFI_STATUS, JS_UNDEFINED));
  JS_SetPropertyStr(ctx, wifi, "ip",
                    JS_NewCFunctionParams(ctx, FUNC_WIFI_IP, JS_UNDEFINED));
  JS_SetPropertyStr(ctx, global_obj, "WiFi", wifi);

  // http namespace
  JSValue http = JS_NewObject(ctx);
  JS_SetPropertyStr(ctx, http, "get",
                    JS_NewCFunctionParams(ctx, FUNC_HTTP_GET, JS_UNDEFINED));
  JS_SetPropertyStr(ctx, global_obj, "http", http);

