lelebrr/Willy_ESP32_S3/src/modules/bjs_interpreter/mqjs_bindings.cpp
  // storage namespace
  JSValue storage = JS_NewObject(ctx);
  JS_SetPropertyStr(
      ctx, storage, "read",
      JS_NewCFunctionParams(ctx, FUNC_STORAGE_READ, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, storage, "write",
      JS_NewCFunctionParams(ctx, FUNC_STORAGE_WRITE, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, storage, "remove",
      JS_NewCFunctionParams(ctx, FUNC_STORAGE_REMOVE, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, storage, "exists",
      JS_NewCFunctionParams(ctx, FUNC_STORAGE_EXISTS, JS_UNDEFINED));
  JS_SetPropertyStr(ctx, global_obj, "storage", storage);

  // subghz namespace
  JSValue subghz = JS_NewObject(ctx);
  JS_SetPropertyStr(ctx, subghz, "tx",
                    JS_NewCFunctionParams(ctx, FUNC_SUBGHZ_TX, JS_UNDEFINED));
  JS_SetPropertyStr(ctx, global_obj, "subghz", subghz);

  // badusb namespace
  JSValue badusb = JS_NewObject(ctx);
  JS_SetPropertyStr(ctx, badusb, "run",
                    JS_NewCFunctionParams(ctx, FUNC_BADUSB_RUN, JS_UNDEFINED));
  JS_SetPropertyStr(ctx, global_obj, "badusb", badusb);

  // device namespace
  JSValue device = JS_NewObject(ctx);
  JS_SetPropertyStr(
      ctx, device, "battery",
      JS_NewCFunctionParams(ctx, FUNC_DEVICE_BATTERY, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, device, "freeHeap",
      JS_NewCFunctionParams(ctx, FUNC_DEVICE_FREEHEAP, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, device, "board",
      JS_NewCFunctionParams(ctx, FUNC_DEVICE_BOARD, JS_UNDEFINED));
  JS_SetPropertyStr(ctx, device, "sdk",
                    JS_NewCFunctionParams(ctx, FUNC_DEVICE_SDK, JS_UNDEFINED));
  JS_SetPropertyStr(ctx, device, "getWillyVersion",
                    JS_NewString(ctx, WILLY_VERSION));
  JS_SetPropertyStr(ctx, device, "getBruceVersion",
                    JS_NewString(ctx, WILLY_VERSION));
  JS_SetPropertyStr(ctx, global_obj, "device", device);

  // Color constants for scripts
  JS_SetPropertyStr(ctx, global_obj, "WILLY_BGCOLOR", JS_NewInt32(ctx, 0x0000));
  JS_SetPropertyStr(ctx, global_obj, "WILLY_PRICOLOR",
                    JS_NewInt32(ctx, DEFAULT_PRICOLOR));
  JS_SetPropertyStr(ctx, global_obj, "WILLY_SECCOLOR",
                    JS_NewInt32(ctx, DEFAULT_SECCOLOR));
  JS_SetPropertyStr(ctx, global_obj, "WILLY_BGCOLOR", JS_NewInt32(ctx, 0x0000));
  JS_SetPropertyStr(ctx, global_obj, "WILLY_PRICOLOR",
                    JS_NewInt32(ctx, DEFAULT_PRICOLOR));
  JS_SetPropertyStr(ctx, global_obj, "WILLY_SECCOLOR",
                    JS_NewInt32(ctx, DEFAULT_SECCOLOR));

  // ir namespace
  JSValue ir = JS_NewObject(ctx);
  JS_SetPropertyStr(ctx, ir, "tx",
                    JS_NewCFunctionParams(ctx, FUNC_IR_TX, JS_UNDEFINED));
  JS_SetPropertyStr(ctx, ir, "send",
                    JS_NewCFunctionParams(ctx, FUNC_IR_SEND, JS_UNDEFINED));
  JS_SetPropertyStr(ctx, global_obj, "ir", ir);

  // keyboard namespace
  JSValue keyboard = JS_NewObject(ctx);
  JS_SetPropertyStr(
      ctx, keyboard, "input",
      JS_NewCFunctionParams(ctx, FUNC_KEYBOARD_INPUT, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, keyboard, "hex",
      JS_NewCFunctionParams(ctx, FUNC_KEYBOARD_HEX, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, keyboard, "num",
      JS_NewCFunctionParams(ctx, FUNC_KEYBOARD_NUM, JS_UNDEFINED));
  JS_SetPropertyStr(ctx, global_obj, "keyboard", keyboard);

  // dialog namespace
  JSValue dialog = JS_NewObject(ctx);
  JS_SetPropertyStr(
      ctx, dialog, "error",
      JS_NewCFunctionParams(ctx, FUNC_DIALOG_ERROR, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, dialog, "warning",
      JS_NewCFunctionParams(ctx, FUNC_DIALOG_WARNING, JS_UNDEFINED));
  JS_SetPropertyStr(ctx, dialog, "info",
                    JS_NewCFunctionParams(ctx, FUNC_DIALOG_INFO, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, dialog, "success",
      JS_NewCFunctionParams(ctx, FUNC_DIALOG_SUCCESS, JS_UNDEFINED));
  JS_SetPropertyStr(ctx, global_obj, "dialog", dialog);

  // compat namespace
  JSValue compat = JS_NewObject(ctx);
  JS_SetPropertyStr(
      ctx, compat, "getBoardName",
      JS_NewCFunctionParams(ctx, FUNC_COMPAT_GETBOARDNAME, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, compat, "getCpuFreqMHz",
      JS_NewCFunctionParams(ctx, FUNC_COMPAT_GETCPUFREQ, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, compat, "getFreeHeap",
      JS_NewCFunctionParams(ctx, FUNC_COMPAT_GETFREEHEAP, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, compat, "getFlashChipSize",
      JS_NewCFunctionParams(ctx, FUNC_COMPAT_GETFLASHCHIPSIZE, JS_UNDEFINED));
  JS_SetPropertyStr(
      ctx, compat, "getSdkVersion",
      JS_NewCFunctionParams(ctx, FUNC_COMPAT_GETSDKVERSION, JS_UNDEFINED));
  JS_SetPropertyStr(ctx, global_obj, "compat", compat);

  // Check for exceptions after init
  if (JS_IsException(global_obj)) {
    JSValue ex = JS_GetException(ctx);
    JSCStringBuf buf;
    const char *err = JS_TO_CSTRING(ctx, ex, &buf);
    Serial.printf("JS Init Error: %s\n", err ? err : "Unknown");
  }
}
